package myjavelessons2024;

//Закоментуй непотрібні рядки коду, щоб вивести на екран цифру 5.
//Примітка. Потрібно закоментувати лише два рядки.
//Требования:
//
//    •
//    Програма має виводити на екран цифру 5
//    •
//    Не можна змінювати рядок з оголошенням змінної x.
//    •
//    Не можна змінювати тіло методу main(String[]), можна лише закоментувати певні 2 рядки.
public class QuestOne {
    public static void main(String[] args) {
        int x = 7;
       // x = x & 25;
        x = x & 5;
       // x = x & 3;
        x = x & 12;
        x = x | 1;
        System.out.println(x);
    }
}
